lighttransport/gemm/rdna4/sam3d/sam3d_cpu.c
/* sam3d_cpu.c — CPU helpers used by the CUDA SAM 3D Objects runner.
 *
 * Phase 1a: provides a CPU-fallback DINOv2 forward pass so the CUDA
 * runner can validate downstream plumbing (D2H readback, debug
 * overrides, verify_dinov2 numerics) before per-stage NVRTC kernels
 * land. Subsequent phases replace the calls inside this TU one stage
 * at a time; the wrapper API surface stays stable so verify_*.c can
 * keep diffing against the same /tmp/sam3d_ref/ dumps.
 *
 * SAFETENSORS_IMPLEMENTATION is provided exclusively by
 * hip_sam3d_runner.c. We pre-include the safetensors header here
 * (declarations only) so its include guard fires before dinov2.h's
 * SAFETENSORS_IMPLEMENTATION-prefixed include runs, matching the
 * sam3d_body_cpu.c pattern.
 */

#include "sam3d_cpu.h"

#include <math.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "../../common/safetensors.h"

#define GGML_DEQUANT_IMPLEMENTATION
#include "../../common/ggml_dequant.h"

#define DINOV2_IMPLEMENTATION
#include "../../common/dinov2.h"

#define SAM3D_COND_FUSER_IMPLEMENTATION
#include "../../common/sam3d_cond_fuser.h"

#define SAM3D_SS_FLOW_DIT_IMPLEMENTATION
#include "../../common/sam3d_ss_flow_dit.h"

#include "../../common/sam3d_shortcut_solver.h"

#define T2_SS_DEC_IMPLEMENTATION
#include "../../common/trellis2_ss_decoder.h"

#define SPARSE3D_IMPLEMENTATION
#include "../../common/sparse3d.h"

#define SAM3D_SLAT_DIT_IMPLEMENTATION
#include "../../common/sam3d_slat_dit.h"

#define SAM3D_GS_DECODER_IMPLEMENTATION
#include "../../common/sam3d_gs_decoder.h"

struct sam3d_cpu_dinov2 {
    dinov2_model *m;
};

sam3d_cpu_dinov2 *sam3d_cpu_dinov2_load(const char *path)
{
    if (!path) return NULL;
    dinov2_model *m = dinov2_load_safetensors(path);
    if (!m) return NULL;
    sam3d_cpu_dinov2 *w = (sam3d_cpu_dinov2 *)calloc(1, sizeof(*w));
    if (!w) { dinov2_free(m); return NULL; }
    w->m = m;
    return w;
}

void sam3d_cpu_dinov2_free(sam3d_cpu_dinov2 *w)
{
    if (!w) return;
    if (w->m) dinov2_free(w->m);
    free(w);
}

int sam3d_cpu_dinov2_image_size(const sam3d_cpu_dinov2 *w)
{
    return w && w->m ? w->m->image_size : 0;
}

int sam3d_cpu_dinov2_dim(const sam3d_cpu_dinov2 *w)
{
    return w && w->m ? w->m->dim : 0;
}

int sam3d_cpu_dinov2_n_register(const sam3d_cpu_dinov2 *w)
{
    return w && w->m ? w->m->n_register : 0;
}

/* Same fp32 RGB bilinear-resize + ImageNet-normalize used by
 * cpu/sam3d/sam3d_runner.c. Kept private here so the CPU-fallback
 * matches the CPU runner numerics byte-for-byte. */
static void sp_prep_rgb_f32(float *out_chw,
                            const uint8_t *rgba, int iw, int ih,
                            int ow, int oh,
                            const float mean[3], const float std[3])
{
    int s = (iw > ih) ? iw : ih;
    int ox = (s - iw) / 2;
    int oy = (s - ih) / 2;
    float scale_y = (float)s / (float)oh;
    float scale_x = (float)s / (float)ow;
#if defined(_OPENMP)
    #pragma omp parallel for schedule(static)
#endif
    for (int y = 0; y < oh; y++) {
        float fy = ((float)y + 0.5f) * scale_y - 0.5f;
        int y0 = (int)floorf(fy);
        int y1 = y0 + 1;
        float dy = fy - (float)y0;
        int y0s = y0 - oy, y1s = y1 - oy;
        for (int x = 0; x < ow; x++) {
            float fx = ((float)x + 0.5f) * scale_x - 0.5f;
            int x0 = (int)floorf(fx);
            int x1 = x0 + 1;
            float dx = fx - (float)x0;
            int x0s = x0 - ox, x1s = x1 - ox;
            for (int c = 0; c < 3; c++) {
                float a00 = 0.f, a01 = 0.f, a10 = 0.f, a11 = 0.f;
                if (y0s >= 0 && y0s < ih) {
                    if (x0s >= 0 && x0s < iw)
                        a00 = (float)rgba[(y0s * iw + x0s) * 4 + c];
                    if (x1s >= 0 && x1s < iw)
                        a01 = (float)rgba[(y0s * iw + x1s) * 4 + c];
                }
                if (y1s >= 0 && y1s < ih) {
                    if (x0s >= 0 && x0s < iw)
                        a10 = (float)rgba[(y1s * iw + x0s) * 4 + c];
                    if (x1s >= 0 && x1s < iw)
                        a11 = (float)rgba[(y1s * iw + x1s) * 4 + c];
                }
                float v = a00 * (1 - dy) * (1 - dx)
                        + a01 * (1 - dy) * dx
                        + a10 * dy       * (1 - dx)
                        + a11 * dy       * dx;
                v /= 255.0f;
                out_chw[c * oh * ow + y * ow + x] = (v - mean[c]) / std[c];
            }
        }
    }
}

static void sp_prep_mask_f32(float *out_chw,
                             const uint8_t *mask, int mw, int mh,
                             int ow, int oh,
                             const float mean[3], const float std[3])
{
    int s = (mw > mh) ? mw : mh;
    int ox = (s - mw) / 2;
    int oy = (s - mh) / 2;
    float scale_y = (float)s / (float)oh;
    float scale_x = (float)s / (float)ow;
#if defined(_OPENMP)
    #pragma omp parallel for schedule(static)
#endif
    for (int y = 0; y < oh; y++) {
        int my_src = (int)floorf((float)y * scale_y) - oy;
        for (int x = 0; x < ow; x++) {
            int mx_src = (int)floorf((float)x * scale_x) - ox;
            float v = 0.0f;
            if (my_src >= 0 && my_src < mh && mx_src >= 0 && mx_src < mw)
                v = (mask[my_src * mw + mx_src] > 0) ? 1.0f : 0.0f;
            for (int c = 0; c < 3; c++)
                out_chw[c * oh * ow + y * ow + x] = (v - mean[c]) / std[c];
        }
    }
}

float *sam3d_cpu_dinov2_preprocess_rgb(sam3d_cpu_dinov2 *w,
                                       const uint8_t *rgba, int iw, int ih)
{
    if (!w || !w->m || !rgba) return NULL;
    int S = w->m->image_size;
    float *chw = (float *)malloc((size_t)3 * S * S * sizeof(float));
    if (!chw) return NULL;
    sp_prep_rgb_f32(chw, rgba, iw, ih, S, S, w->m->image_mean, w->m->image_std);
    return chw;
}

float *sam3d_cpu_dinov2_preprocess_mask(sam3d_cpu_dinov2 *w,
                                        const uint8_t *mask, int mw, int mh)
{
    if (!w || !w->m || !mask) return NULL;
    int S = w->m->image_size;
    float *chw = (float *)malloc((size_t)3 * S * S * sizeof(float));
    if (!chw) return NULL;
    sp_prep_mask_f32(chw, mask, mw, mh, S, S, w->m->image_mean, w->m->image_std);
    return chw;
}

float *sam3d_cpu_dinov2_encode_rgba(sam3d_cpu_dinov2 *w,
                                    const uint8_t *rgba, int iw, int ih,
                                    const uint8_t *mask, int mw, int mh,
                                    int n_threads,
                                    int *n_tokens_out, int *dim_out)
{
    if (!w || !w->m || !rgba) return NULL;
    dinov2_model *m = w->m;
    int img_sz = m->image_size;
    int n_reg  = m->n_register;
    int dim    = m->dim;

    float *chw_img = (float *)malloc((size_t)3 * img_sz * img_sz * sizeof(float));
    if (!chw_img) return NULL;
    sp_prep_rgb_f32(chw_img, rgba, iw, ih, img_sz, img_sz,
                    m->image_mean, m->image_std);
    dinov2_result r_img = dinov2_encode_f32(m, chw_img, img_sz, img_sz, n_threads);
    free(chw_img);
    if (!r_img.features) return NULL;
    dinov2_result_drop_registers(&r_img, n_reg);

