lighttransport/gemm/rdna4/sam3d/sam3d_cpu.c
    dinov2_result r_msk = {0};
    if (mask) {
        float *chw_msk = (float *)malloc((size_t)3 * img_sz * img_sz * sizeof(float));
        if (!chw_msk) { dinov2_result_free(&r_img); return NULL; }
        sp_prep_mask_f32(chw_msk, mask, mw, mh, img_sz, img_sz,
                         m->image_mean, m->image_std);
        r_msk = dinov2_encode_f32(m, chw_msk, img_sz, img_sz, n_threads);
        free(chw_msk);
        if (!r_msk.features) { dinov2_result_free(&r_img); return NULL; }
        dinov2_result_drop_registers(&r_msk, n_reg);
    }

    int n_tok = r_img.n_tokens;
    int n_branches = r_msk.features ? 2 : 1;
    int n_total = n_branches * n_tok;
    float *out = (float *)malloc((size_t)n_total * dim * sizeof(float));
    if (!out) { dinov2_result_free(&r_img); dinov2_result_free(&r_msk); return NULL; }
    memcpy(out, r_img.features, (size_t)n_tok * dim * sizeof(float));
    if (r_msk.features) {
        memcpy(out + (size_t)n_tok * dim, r_msk.features,
               (size_t)n_tok * dim * sizeof(float));
    }
    dinov2_result_free(&r_img);
    dinov2_result_free(&r_msk);
    if (n_tokens_out) *n_tokens_out = n_total;
    if (dim_out)      *dim_out      = dim;
    return out;
}

/* ===== CondEmbedderFuser ===== */

struct sam3d_cpu_fuser {
    sam3d_ppe_model   *ppe;
    sam3d_fuser_model *fuser;
};

sam3d_cpu_fuser *sam3d_cpu_fuser_load(const char *safetensors_dir)
{
    if (!safetensors_dir) return NULL;
    char path[1200];
    sam3d_cpu_fuser *w = (sam3d_cpu_fuser *)calloc(1, sizeof(*w));
    if (!w) return NULL;

    snprintf(path, sizeof(path), "%s/sam3d_point_patch_embed.safetensors",
             safetensors_dir);
    w->ppe = sam3d_ppe_load_safetensors(path);
    if (!w->ppe) { sam3d_cpu_fuser_free(w); return NULL; }

    snprintf(path, sizeof(path), "%s/sam3d_cond_fuser.safetensors",
             safetensors_dir);
    w->fuser = sam3d_fuser_load_safetensors(path);
    if (!w->fuser) { sam3d_cpu_fuser_free(w); return NULL; }
    return w;
}

void sam3d_cpu_fuser_free(sam3d_cpu_fuser *w)
{
    if (!w) return;
    if (w->ppe)   sam3d_ppe_free(w->ppe);
    if (w->fuser) sam3d_fuser_free(w->fuser);
    free(w);
}

int sam3d_cpu_fuser_dim_out(const sam3d_cpu_fuser *w)
{
    return (w && w->fuser) ? w->fuser->embed_dim_out : 0;
}

/* Shared core: takes already-computed PPE tokens (or NULL) and runs
 * the per-modality projections + pos embeds + concat. */
static float *cs3d_fuser_assemble(sam3d_cpu_fuser *w,
                                  const float *dino_tokens,
                                  int dino_n, int dino_dim,
                                  const float *ppe_tokens,
                                  int n_ppe, int ppe_dim,
                                  int n_threads,
                                  int *n_tokens_out, int *dim_out)
{
    sam3d_fuser_model *fuser = w->fuser;
    int D_out  = fuser->embed_dim_out;
    int branch = dino_n / 2;
    if (branch <= 0 || branch * 2 != dino_n) return NULL;
    if (ppe_tokens && ppe_dim != w->ppe->embed_dim) return NULL;
    const int pos = SAM3D_FUSER_POS_FULL;

    float *dino_img = sam3d_fuser_project(fuser, SAM3D_FUSER_MOD_DINO_IMG,
                                          dino_tokens, branch, n_threads);
    if (!dino_img) return NULL;
    sam3d_fuser_add_pos(fuser, pos, dino_img, branch);

    float *dino_msk = sam3d_fuser_project(fuser, SAM3D_FUSER_MOD_DINO_MSK,
                                          dino_tokens + (size_t)branch * dino_dim,
                                          branch, n_threads);
    if (!dino_msk) { free(dino_img); return NULL; }
    sam3d_fuser_add_pos(fuser, pos, dino_msk, branch);

    float *point = NULL;
    int point_n = 0;
    if (ppe_tokens && n_ppe > 0) {
        point = sam3d_fuser_project(fuser, SAM3D_FUSER_MOD_POINT,
                                    ppe_tokens, n_ppe, n_threads);
        if (!point) { free(dino_img); free(dino_msk); return NULL; }
        sam3d_fuser_add_pos(fuser, pos, point, n_ppe);
        point_n = n_ppe;
    }

    int n_total = branch * 2 + point_n;
    float *out = (float *)malloc((size_t)n_total * D_out * sizeof(float));
    if (!out) { free(dino_img); free(dino_msk); free(point); return NULL; }
    memcpy(out, dino_img, (size_t)branch * D_out * sizeof(float));
    memcpy(out + (size_t)branch * D_out, dino_msk,
           (size_t)branch * D_out * sizeof(float));
    if (point) {
        memcpy(out + (size_t)2 * branch * D_out, point,
               (size_t)point_n * D_out * sizeof(float));
    }
    free(dino_img); free(dino_msk); free(point);

    if (n_tokens_out) *n_tokens_out = n_total;
    if (dim_out)      *dim_out      = D_out;
    return out;
}

float *sam3d_cpu_fuser_run(sam3d_cpu_fuser *w,
                           const float *dino_tokens,
                           int dino_n, int dino_dim,
                           const float *pointmap_xyz, int ph, int pw,
                           int n_threads,
                           int *n_tokens_out, int *dim_out)
{
    if (!w || !w->fuser || !w->ppe || !dino_tokens || dino_n <= 0 || dino_dim <= 0)
        return NULL;
    if (n_threads < 1) n_threads = 1;

    float *ppe_tokens = NULL;
    int n_ppe = 0, ppe_dim = 0;
    if (pointmap_xyz && ph > 0 && pw > 0) {
        ppe_tokens = sam3d_ppe_encode(w->ppe, pointmap_xyz, ph, pw,
                                      NULL, n_threads);
        if (!ppe_tokens) return NULL;
        n_ppe   = w->ppe->num_patches * w->ppe->num_patches;
        ppe_dim = w->ppe->embed_dim;
    }
    float *out = cs3d_fuser_assemble(w, dino_tokens, dino_n, dino_dim,
                                     ppe_tokens, n_ppe, ppe_dim,
                                     n_threads, n_tokens_out, dim_out);
    free(ppe_tokens);
    return out;
}

float *sam3d_cpu_fuser_run_with_ppe_tokens(sam3d_cpu_fuser *w,
                           const float *dino_tokens,
                           int dino_n, int dino_dim,
                           const float *ppe_tokens,
                           int n_ppe, int ppe_dim,
                           int n_threads,
                           int *n_tokens_out, int *dim_out)
{
    if (!w || !w->fuser || !w->ppe || !dino_tokens || dino_n <= 0 || dino_dim <= 0)
        return NULL;
    if (n_threads < 1) n_threads = 1;
    return cs3d_fuser_assemble(w, dino_tokens, dino_n, dino_dim,
                               ppe_tokens, n_ppe, ppe_dim,
                               n_threads, n_tokens_out, dim_out);
}

int sam3d_cpu_fuser_ppe_num_patches(const sam3d_cpu_fuser *w) {
    return (w && w->ppe) ? w->ppe->num_patches : 0;
}
int sam3d_cpu_fuser_ppe_input_size(const sam3d_cpu_fuser *w) {
    return (w && w->ppe) ? w->ppe->input_size : 0;
}
int sam3d_cpu_fuser_ppe_embed_dim(const sam3d_cpu_fuser *w) {
    return (w && w->ppe) ? w->ppe->embed_dim : 0;
}
struct sam3d_ppe_model *sam3d_cpu_fuser_ppe_model(sam3d_cpu_fuser *w) {
    return w ? w->ppe : NULL;
}
struct sam3d_fuser_model *sam3d_cpu_fuser_fuser_model(sam3d_cpu_fuser *w) {
    return w ? w->fuser : NULL;
}

/* ===== SS Flow DiT ===== */

struct sam3d_cpu_ss_dit {
    sam3d_ss_flow_dit_model *m;
};

/* Five modality element counts per latent_mapping (yaml).
 * SHAPE [4096*8], 6DROT [1*6], TRANSLATION [1*3], SCALE [1*3], TRANSLATION_SCALE [1*1]. */
static const int sam3d_cpu_ss_dit_lat_elts_table[SAM3D_SS_DIT_N_LATENTS] = {
    4096 * 8, 1 * 6, 1 * 3, 1 * 3, 1 * 1
};

