lighttransport/gemm/rdna4/sam3d/sam3d_cpu.c
sam3d_cpu_ss_dit *sam3d_cpu_ss_dit_load(const char *safetensors_dir)
{
    if (!safetensors_dir) return NULL;
    char path[1200];
    snprintf(path, sizeof(path), "%s/sam3d_ss_dit.safetensors", safetensors_dir);
    sam3d_ss_flow_dit_model *m = sam3d_ss_flow_dit_load_safetensors(path);
    if (!m) return NULL;
    sam3d_cpu_ss_dit *w = (sam3d_cpu_ss_dit *)calloc(1, sizeof(*w));
    if (!w) { sam3d_ss_flow_dit_free(m); return NULL; }
    w->m = m;
    return w;
}

void sam3d_cpu_ss_dit_free(sam3d_cpu_ss_dit *w)
{
    if (!w) return;
    if (w->m) sam3d_ss_flow_dit_free(w->m);
    free(w);
}

int sam3d_cpu_ss_dit_n_blocks      (const sam3d_cpu_ss_dit *w) { return (w && w->m) ? w->m->n_blocks      : 0; }
int sam3d_cpu_ss_dit_dim           (const sam3d_cpu_ss_dit *w) { return (w && w->m) ? w->m->dim           : 0; }
int sam3d_cpu_ss_dit_cond_channels (const sam3d_cpu_ss_dit *w) { return (w && w->m) ? w->m->cond_channels : 0; }
int sam3d_cpu_ss_dit_is_shortcut   (const sam3d_cpu_ss_dit *w) { return (w && w->m) ? w->m->is_shortcut   : 0; }
int sam3d_cpu_ss_dit_n_latents     (void)                      { return SAM3D_SS_DIT_N_LATENTS; }
int sam3d_cpu_ss_dit_lat_elts(int i)
{
    if (i < 0 || i >= SAM3D_SS_DIT_N_LATENTS) return 0;
    return sam3d_cpu_ss_dit_lat_elts_table[i];
}

struct sam3d_ss_flow_dit_model *sam3d_cpu_ss_dit_model(sam3d_cpu_ss_dit *w)
{
    return w ? w->m : NULL;
}

int sam3d_cpu_ss_dit_forward(sam3d_cpu_ss_dit *w,
                             const float *const *latents_in,
                             float *const *latents_out,
                             const float *cond, int n_cond,
                             float t, float d, int n_threads)
{
    if (!w || !w->m || !latents_in || !latents_out || !cond) return -1;
    if (n_threads < 1) n_threads = 1;
    return sam3d_ss_flow_dit_forward(w->m, latents_in, latents_out,
                                     cond, n_cond, t, d, n_threads);
}

/* xorshift64* + Box-Muller; identical seed schedule to cpu/sam3d/sam3d_runner.c
 * so byte-for-byte numerics match the CPU runner. */
static inline uint64_t cs3d_rng_next(uint64_t *state) {
    uint64_t x = *state;
    x ^= x >> 12; x ^= x << 25; x ^= x >> 27;
    *state = x;
    return x * 0x2545F4914F6CDD1DULL;
}
static inline float cs3d_rng_u01(uint64_t *state) {
    uint64_t r = cs3d_rng_next(state) >> 11;
    return (float)((double)r * (1.0 / 9007199254740992.0));
}
static void cs3d_fill_randn(float *buf, int n, uint64_t *state) {
    for (int i = 0; i < n; i += 2) {
        float u1 = cs3d_rng_u01(state); if (u1 < 1e-7f) u1 = 1e-7f;
        float u2 = cs3d_rng_u01(state);
        float r = sqrtf(-2.0f * logf(u1));
        float a = 6.2831853f * u2;
        buf[i] = r * cosf(a);
        if (i + 1 < n) buf[i + 1] = r * sinf(a);
    }
}

int sam3d_cpu_ss_dit_run_ode(sam3d_cpu_ss_dit *w,
                             const float *cond, int n_cond,
                             int steps, uint64_t seed, float cfg_scale,
                             int n_threads,
                             float *ss_latent_ncdhw)
{
    if (!w || !w->m || !cond || !ss_latent_ncdhw || steps <= 0) return -1;
    if (n_threads < 1) n_threads = 1;

    float *lat[SAM3D_SS_DIT_N_LATENTS] = {0};
    float *vel[SAM3D_SS_DIT_N_LATENTS] = {0};
    float *vel_u[SAM3D_SS_DIT_N_LATENTS] = {0};
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        int n = sam3d_cpu_ss_dit_lat_elts_table[i];
        lat[i] = (float *)malloc((size_t)n * sizeof(float));
        vel[i] = (float *)malloc((size_t)n * sizeof(float));
        vel_u[i] = (float *)malloc((size_t)n * sizeof(float));
        if (!lat[i] || !vel[i] || !vel_u[i]) goto oom;
    }

    uint64_t rng = seed ? seed : 0x9E3779B97F4A7C15ULL;
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++)
        cs3d_fill_randn(lat[i], sam3d_cpu_ss_dit_lat_elts_table[i], &rng);

    float *times = (float *)malloc((size_t)(steps + 1) * sizeof(float));
    if (!times) goto oom;
    sam3d_shortcut_make_times(times, steps, 3.0f, /*reversed=*/0);
    float d = sam3d_shortcut_d(steps, /*no_shortcut=*/1);
    /* Pre-scale t,d by time_scale=1000 to match upstream `_generate_dynamics`
     * (model trained on t in [0, 1000]; raw t in [0,1] gives garbage). */
    const float TIME_SCALE = w->m->time_scale;

    float *zero_cond = NULL;
    if (cfg_scale > 0.0f) {
        zero_cond = (float *)calloc((size_t)n_cond * w->m->cond_channels,
                                    sizeof(float));
        if (!zero_cond) { free(times); goto oom; }
    }

    for (int s = 0; s < steps; s++) {
        float t  = times[s];
        float dt = times[s + 1] - times[s];
        float ts = t * TIME_SCALE;
        if (sam3d_ss_flow_dit_forward(w->m,
                                      (const float *const *)lat, vel,
                                      cond, n_cond,
                                      ts, d * TIME_SCALE,
                                      n_threads) != 0) {
            free(times); free(zero_cond);
            goto oom;
        }
        if (zero_cond && sam3d_shortcut_cfg_active(ts, 0.0f, 500.0f)) {
            if (sam3d_ss_flow_dit_forward(w->m,
                                          (const float *const *)lat, vel_u,
                                          zero_cond, n_cond,
                                          ts, d * TIME_SCALE,
                                          n_threads) != 0) {
                free(times); free(zero_cond);
                goto oom;
            }
            for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
                sam3d_shortcut_cfg_combine(vel[i], vel[i], vel_u[i],
                                           cfg_scale,
                                           sam3d_cpu_ss_dit_lat_elts_table[i]);
            }
        }
        for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++)
            sam3d_shortcut_euler_step(lat[i], vel[i], dt,
                                      sam3d_cpu_ss_dit_lat_elts_table[i]);
    }
    free(times); free(zero_cond);

    /* SHAPE → NCDHW [8, 16, 16, 16]. Source layout from DiT is [N=4096, C=8]. */
    for (int n = 0; n < 4096; n++)
        for (int c = 0; c < 8; c++)
            ss_latent_ncdhw[c * 4096 + n] = lat[SAM3D_SS_LAT_SHAPE][n * 8 + c];

    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        free(lat[i]); free(vel[i]); free(vel_u[i]);
    }
    return 0;

