lighttransport/gemm/rdna4/sam3d/sam3d_cpu.c
oom:
    for (int i = 0; i < SAM3D_SS_DIT_N_LATENTS; i++) {
        free(lat[i]); free(vel[i]); free(vel_u[i]);
    }
    return -2;
}

/* ===== SS-VAE 3D-conv decoder ===== */

struct sam3d_cpu_ss_dec {
    t2_ss_dec *m;
};

sam3d_cpu_ss_dec *sam3d_cpu_ss_dec_load(const char *safetensors_dir)
{
    if (!safetensors_dir) return NULL;
    char path[1200];
    snprintf(path, sizeof(path), "%s/sam3d_ss_decoder.safetensors", safetensors_dir);
    t2_ss_dec *m = t2_ss_dec_load(path);
    if (!m) return NULL;
    sam3d_cpu_ss_dec *w = (sam3d_cpu_ss_dec *)calloc(1, sizeof(*w));
    if (!w) { t2_ss_dec_free(m); return NULL; }
    w->m = m;
    return w;
}

void sam3d_cpu_ss_dec_free(sam3d_cpu_ss_dec *w)
{
    if (!w) return;
    if (w->m) t2_ss_dec_free(w->m);
    free(w);
}

void *sam3d_cpu_ss_dec_model(sam3d_cpu_ss_dec *w)
{
    return w ? w->m : NULL;
}

float *sam3d_cpu_ss_dec_forward(sam3d_cpu_ss_dec *w,
                                const float *latent_ncdhw,
                                int n_threads)
{
    if (!w || !w->m || !latent_ncdhw) return NULL;
    if (n_threads < 1) n_threads = 1;
    return t2_ss_dec_forward(w->m, latent_ncdhw, n_threads);
}

/* ===== SLAT Flow DiT ===== */

struct sam3d_cpu_slat_dit {
    sam3d_slat_dit_model *m;
};

sam3d_cpu_slat_dit *sam3d_cpu_slat_dit_load(const char *safetensors_dir)
{
    if (!safetensors_dir) return NULL;
    char path[1200];
    snprintf(path, sizeof(path), "%s/sam3d_slat_dit.safetensors", safetensors_dir);
    sam3d_slat_dit_model *m = sam3d_slat_dit_load_safetensors(path);
    if (!m) return NULL;
    sam3d_cpu_slat_dit *w = (sam3d_cpu_slat_dit *)calloc(1, sizeof(*w));
    if (!w) { sam3d_slat_dit_free(m); return NULL; }
    w->m = m;
    return w;
}

void sam3d_cpu_slat_dit_free(sam3d_cpu_slat_dit *w)
{
    if (!w) return;
    if (w->m) sam3d_slat_dit_free(w->m);
    free(w);
}

int sam3d_cpu_slat_dit_in_channels  (const sam3d_cpu_slat_dit *w) { return (w && w->m) ? w->m->in_channels   : 0; }
int sam3d_cpu_slat_dit_out_channels (const sam3d_cpu_slat_dit *w) { return (w && w->m) ? w->m->out_channels  : 0; }
int sam3d_cpu_slat_dit_cond_channels(const sam3d_cpu_slat_dit *w) { return (w && w->m) ? w->m->cond_channels : 0; }
void *sam3d_cpu_slat_dit_model(sam3d_cpu_slat_dit *w) { return w ? w->m : NULL; }

void sam3d_cpu_slat_dit_set_transformer_hook(sam3d_cpu_slat_transformer_hook_fn fn,
                                             void *user)
{
    sam3d_slat_dit_set_transformer_hook((sam3d_slat_dit_transformer_hook_fn)fn, user);
}

void sam3d_cpu_slat_dit_set_ape_transformer_hook(sam3d_cpu_slat_ape_transformer_hook_fn fn,
                                                 void *user)
{
    sam3d_slat_dit_set_ape_transformer_hook((sam3d_slat_dit_ape_transformer_hook_fn)fn, user);
}

void sam3d_cpu_slat_dit_set_input_layer_hook(sam3d_cpu_slat_input_layer_hook_fn fn,
                                             void *user)
{
    sam3d_slat_dit_set_input_layer_hook((sam3d_slat_dit_input_layer_hook_fn)fn, user);
}

void sam3d_cpu_slat_dit_set_io_block_hook(sam3d_cpu_slat_io_block_hook_fn fn,
                                          void *user)
{
    sam3d_slat_dit_set_io_block_hook((sam3d_slat_dit_io_block_hook_fn)fn, user);
}

void sam3d_cpu_slat_dit_set_final_layer_hook(sam3d_cpu_slat_final_layer_hook_fn fn,
                                             void *user)
{
    sam3d_slat_dit_set_final_layer_hook((sam3d_slat_dit_final_layer_hook_fn)fn, user);
}

float *sam3d_cpu_slat_dit_forward(sam3d_cpu_slat_dit *w,
                                  const int32_t *coords,
                                  const float *feats, int N,
                                  float t,
                                  const float *cond, int n_cond,
                                  int n_threads)
{
    if (!w || !w->m || !coords || !feats || N <= 0 || !cond) return NULL;
    if (n_threads < 1) n_threads = 1;
    sp3d_tensor *x = sp3d_create(coords, feats, N, w->m->in_channels, 1);
    if (!x) return NULL;
    if (sam3d_slat_dit_forward(w->m, &x, t, cond, n_cond, n_threads) != 0) {
        sp3d_free(x); return NULL;
    }
    int oc = w->m->out_channels;
    size_t bytes = (size_t)x->N * oc * sizeof(float);
    float *out = (float *)malloc(bytes);
    if (!out) { sp3d_free(x); return NULL; }
    memcpy(out, x->feats, bytes);
    sp3d_free(x);
    return out;
}

/* SLAT un-normalization. Stats are 8-dim and fixed for facebook/sam-3d-objects. */
static const float CS3D_SLAT_MEAN[8] = {
     0.12211431f,  0.37204156f, -1.26521907f, -2.05276058f,
    -3.10432536f, -0.11294304f, -0.85146744f,  0.45506954f,
};
static const float CS3D_SLAT_STD[8] = {
     2.37326008f,  2.13174402f,  2.2413953f,   2.30589401f,
     2.1191894f,   1.8969511f,   2.41684989f,  2.08374642f,
};

int sam3d_cpu_slat_dit_run_ode(sam3d_cpu_slat_dit *w,
                               const float *occupancy,
                               int D, int H, int W,
                               const float *cond, int n_cond,
                               int steps, uint64_t seed, int n_threads,
                               int32_t **out_coords, float **out_feats,
                               int *out_n)
{
    if (!w || !w->m || !occupancy || !cond || !out_coords || !out_feats ||
        !out_n || D <= 0 || H <= 0 || W <= 0 || steps <= 0) return -1;

    int cap = 0;
    for (int i = 0, n = D * H * W; i < n; i++)
        if (occupancy[i] > 0.0f) cap++;
    if (cap == 0) return -2;

    int32_t *coords = (int32_t *)malloc((size_t)cap * 4 * sizeof(int32_t));
    if (!coords) return -3;

    int k = 0;
    for (int z = 0; z < D; z++)
        for (int y = 0; y < H; y++)
            for (int x = 0; x < W; x++)
                if (occupancy[(z * H + y) * W + x] > 0.0f) {
                    coords[k * 4 + 0] = 0;
                    coords[k * 4 + 1] = z;
                    coords[k * 4 + 2] = y;
                    coords[k * 4 + 3] = x;
                    k++;
                }

    int rc = sam3d_cpu_slat_dit_run_ode_from_coords(w, coords, cap,
                                                    cond, n_cond,
                                                    steps, seed, n_threads,
                                                    out_coords, out_feats, out_n);
    free(coords);
    return rc;
}

int sam3d_cpu_slat_dit_run_ode_from_coords(sam3d_cpu_slat_dit *w,
                                           const int32_t *coords_in, int cap,
                                           const float *cond, int n_cond,
                                           int steps, uint64_t seed, int n_threads,
                                           int32_t **out_coords, float **out_feats,
                                           int *out_n)
{
    if (!w || !w->m || !coords_in || !cond || !out_coords || !out_feats ||
        !out_n || cap <= 0 || steps <= 0) return -1;
    if (n_threads < 1) n_threads = 1;
    sam3d_slat_dit_model *m = w->m;

    int32_t *coords = (int32_t *)malloc((size_t)cap * 4 * sizeof(int32_t));
    float   *feats  = (float *)calloc((size_t)cap * m->in_channels, sizeof(float));
    if (!coords || !feats) { free(coords); free(feats); return -3; }
    memcpy(coords, coords_in, (size_t)cap * 4 * sizeof(int32_t));

