lighttransport/gemm/rdna4/sam3d/sam3d_cpu.c
    uint64_t rng = seed ^ 0x5851F42D4C957F2DULL;
    cs3d_fill_randn(feats, cap * m->in_channels, &rng);

    sp3d_tensor *x = sp3d_create(coords, feats, cap, m->in_channels, 1);
    if (!x) { free(coords); free(feats); return -3; }

    /* time_scale=1000 from slat_generator.yaml — same contract as ss_dit. */
    const float TIME_SCALE = 1000.0f;
    for (int s = 0; s < steps; s++) {
        float t = 1.0f - (float)s / (float)steps;
        if (sam3d_slat_dit_forward(m, &x, t * TIME_SCALE,
                                   cond, n_cond, n_threads) != 0) {
            sp3d_free(x); free(coords); free(feats); return -4;
        }
    }

    int oc = m->out_channels;
    int32_t *cout = (int32_t *)malloc((size_t)cap * 4 * sizeof(int32_t));
    float   *fout = (float *)malloc((size_t)cap * oc * sizeof(float));
    if (!cout || !fout) {
        free(cout); free(fout);
        sp3d_free(x); free(coords); free(feats); return -3;
    }
    memcpy(cout, coords, (size_t)cap * 4 * sizeof(int32_t));
    memcpy(fout, x->feats, (size_t)cap * oc * sizeof(float));
    if (oc == 8) {
        for (int i = 0; i < cap; i++) {
            float *r = fout + (size_t)i * oc;
            for (int c = 0; c < oc; c++) r[c] = r[c] * CS3D_SLAT_STD[c] + CS3D_SLAT_MEAN[c];
        }
    }

    sp3d_free(x); free(coords); free(feats);
    *out_coords = cout;
    *out_feats  = fout;
    *out_n      = cap;
    return 0;
}

/* ===== SLAT GS decoder ===== */

struct sam3d_cpu_gs_decoder {
    sam3d_gs_decoder_model *m;
};

sam3d_cpu_gs_decoder *sam3d_cpu_gs_decoder_load(const char *safetensors_dir)
{
    if (!safetensors_dir) return NULL;
    char path[1200];
    snprintf(path, sizeof(path), "%s/sam3d_slat_gs_decoder.safetensors",
             safetensors_dir);
    sam3d_gs_decoder_model *m = sam3d_gs_decoder_load_safetensors(path);
    if (!m) return NULL;
    sam3d_cpu_gs_decoder *w = (sam3d_cpu_gs_decoder *)calloc(1, sizeof(*w));
    if (!w) { sam3d_gs_decoder_free(m); return NULL; }
    w->m = m;
    return w;
}

void sam3d_cpu_gs_decoder_free(sam3d_cpu_gs_decoder *w)
{
    if (!w) return;
    if (w->m) sam3d_gs_decoder_free(w->m);
    free(w);
}

int sam3d_cpu_gs_decoder_in_channels  (const sam3d_cpu_gs_decoder *w) { return (w && w->m) ? w->m->in_channels   : 0; }
int sam3d_cpu_gs_decoder_out_channels (const sam3d_cpu_gs_decoder *w) { return (w && w->m) ? w->m->out_channels  : 0; }
int sam3d_cpu_gs_decoder_num_gaussians(const sam3d_cpu_gs_decoder *w) { return (w && w->m) ? w->m->num_gaussians : 0; }
void *sam3d_cpu_gs_decoder_model(sam3d_cpu_gs_decoder *w) { return w ? w->m : NULL; }

void sam3d_cpu_gs_decoder_set_input_ape_hook(sam3d_cpu_gs_input_ape_hook_fn fn,
                                             void *user)
{
    sam3d_gs_decoder_set_input_ape_hook((sam3d_gs_input_ape_hook_fn)fn, user);
}

void sam3d_cpu_gs_decoder_set_final_layer_hook(sam3d_cpu_gs_final_layer_hook_fn fn,
                                               void *user)
{
    sam3d_gs_decoder_set_final_layer_hook((sam3d_gs_final_layer_hook_fn)fn, user);
}

void sam3d_cpu_gs_decoder_set_window_attn_hook(sam3d_cpu_gs_window_attn_hook_fn fn,
                                               void *user)
{
    sam3d_gs_decoder_set_window_attn_hook((sam3d_gs_window_attn_hook_fn)fn, user);
}

void sam3d_cpu_gs_decoder_set_attn_block_hook(sam3d_cpu_gs_attn_block_hook_fn fn,
                                              void *user)
{
    sam3d_gs_decoder_set_attn_block_hook((sam3d_gs_attn_block_hook_fn)fn, user);
}

void sam3d_cpu_gs_decoder_set_mlp_hook(sam3d_cpu_gs_mlp_hook_fn fn,
                                       void *user)
{
    sam3d_gs_decoder_set_mlp_hook((sam3d_gs_mlp_hook_fn)fn, user);
}

void sam3d_cpu_gs_decoder_set_block_hook(sam3d_cpu_gs_block_hook_fn fn,
                                         void *user)
{
    sam3d_gs_decoder_set_block_hook((sam3d_gs_block_hook_fn)fn, user);
}

void sam3d_cpu_gs_decoder_set_stack_hook(sam3d_cpu_gs_stack_hook_fn fn,
                                         void *user)
{
    sam3d_gs_decoder_set_stack_hook((sam3d_gs_stack_hook_fn)fn, user);
}

void sam3d_cpu_gs_decoder_set_transformer_hook(sam3d_cpu_gs_transformer_hook_fn fn,
                                               void *user)
{
    sam3d_gs_decoder_set_transformer_hook((sam3d_gs_transformer_hook_fn)fn, user);
}

float *sam3d_cpu_gs_decoder_transformer(sam3d_cpu_gs_decoder *w,
                                        const int32_t *coords,
                                        const float *feats, int N,
                                        int n_threads)
{
    if (!w || !w->m || !coords || !feats || N <= 0) return NULL;
    if (n_threads < 1) n_threads = 1;
    sp3d_tensor *x = sp3d_create(coords, feats, N, w->m->in_channels, 1);
    if (!x) return NULL;
    float *out = NULL;
    if (sam3d_gs_decoder_transformer(w->m, x, &out, n_threads) != 0) {
        sp3d_free(x); free(out); return NULL;
    }
    sp3d_free(x);
    return out;
}

int sam3d_cpu_gs_decoder_to_representation(sam3d_cpu_gs_decoder *w,
                                           const int32_t *coords,
                                           const float *feats_out, int N,
                                           float *xyz_out, float *dc_out,
                                           float *scaling_out, float *rotation_out,
                                           float *opacity_out)
{
    if (!w || !w->m || !coords || !feats_out || N <= 0) return -1;
    return sam3d_gs_decoder_to_representation(w->m, coords, feats_out, N,
                                              xyz_out, dc_out, scaling_out,
                                              rotation_out, opacity_out);
}

/* log(softplus(x)) — stable across full x range. Mirrors
 * cpu/sam3d/sam3d_runner.c so PLY-layout numerics are byte-identical. */
static float cs3d_log_softplus(float x) {
    if (x >  20.0f) return logf(x);
    if (x < -15.0f) return x;
    return logf(log1pf(expf(x)));
}

int sam3d_cpu_gs_decoder_pack_ply(const sam3d_cpu_gs_decoder *w,
                                  const float *xyz, const float *dc,
                                  const float *scl, const float *rot,
                                  const float *op,
                                  int total, int stride, float *out_ply)
{
    if (!w || !w->m || !xyz || !dc || !scl || !rot || !op || !out_ply ||
        total <= 0 || stride < 17) return -1;
    const float inv_sp_sb = logf(expf(w->m->scaling_bias) - 1.0f);
#if defined(_OPENMP)
    #pragma omp parallel for
#endif
    for (int i = 0; i < total; i++) {
        float *r = out_ply + (size_t)i * stride;
        r[0] = xyz[i * 3 + 0];
        r[1] = xyz[i * 3 + 1];
        r[2] = xyz[i * 3 + 2];
        r[3] = r[4] = r[5] = 0.0f;        /* normals */
        r[6] = dc[i * 3 + 0];
        r[7] = dc[i * 3 + 1];
        r[8] = dc[i * 3 + 2];
        r[9] = op[i] + w->m->opacity_bias;
        for (int a = 0; a < 3; a++)
            r[10 + a] = cs3d_log_softplus(scl[i * 3 + a] + inv_sp_sb);
        r[13] = rot[i * 4 + 0];
        r[14] = rot[i * 4 + 1];
        r[15] = rot[i * 4 + 2];
        r[16] = rot[i * 4 + 3];
    }
    return 0;
}
